glaya1991/stm32f765_test/TK-NFP-TOP/c_stm32f765zit6/sources/Drivers/ILI9341/Inc/ILI9341_dma.h


#ifndef TEST1_DMA_H
#define TEST1_DMA_H

#include "stm32f7xx_hal.h"
#include "ILI9341_control.h"

#define dmaWait(flag) while(flag!=1){};
//#define dmaWait() while(HAL_SPI_GetState(&hspi1) == HAL_SPI_STATE_READY);
//#define dmaWait() 

#define dmaStartRx(SrcAddress, DstAddress, size) HAL_DMA_Init(&dmaStructure) \
    HAL_DMA_Start (&dmaStructure, SrcAddress, DstAddress, size);

#define dmaStartTx(SrcAddress, DstAddress, size) HAL_DMA_Init(&dmaStructure) \
     HAL_DMA_Start (&dmaStructure, SrcAddress, DstAddress, size);

void dmaInit(void);

void dmaSendCmd(uint8_t cmd);
void dmaSendCmdCont(uint8_t cmd);

void dmaReceiveDataCont8(uint8_t *data);

void dmaSendData8(uint8_t *data, uint32_t n);
void dmaSendData16(uint16_t *data, uint32_t n);

void dmaSendDataCont8(uint8_t *data, uint32_t n);
void dmaSendDataCont16(uint16_t *data, uint32_t n);

void dmaSendDataBuf16();
void dmaSendDataContBuf16(uint16_t *data, uint32_t n);

void dmaFill16(uint16_t color, uint32_t n);

#endif //TEST1_DMA_H
